#格式化字符串
'''方式一： % 占位符'''
name='张三'
age=20
print('我叫%s,今年%d岁了。'%(name,age))

'''方式二： {} 占位符'''
print('我叫{0},今年{1}岁了---{0}'.format(name,age))

'''方式三 s-string'''
print(f'我叫{name},今年{age}岁了。')

'''精度'''
print('%d'%99)      #99
'''宽度'''
print('%10d'%99)    #        99

print('%f'%3.1415926535)    #3.141593
print('%.3f'%3.1415926535)   #3.142
print('%.10f'%3.1415926535) #3.1415926535

'''宽度和精度'''
print('%10.3f'%3.1415926535)    #     3.142；总宽度为10，小数点后 3位
print('1111111111')

'''{}.format()控制精度和宽度'''
'''精度'''
print('{0}'.format(3.1415926535))   #3.1415926535
print('{0:.3}'.format(3.1415926535))#3.14
print('{0:.3f}'.format(3.1415926535))#3.142
'''宽度和精度'''
print('{0:10.3f}'.format(3.1415926535))#     3.142